# encoding: utf-8
# language: ru

Функционал: РасчетВозрастаЧеловекаВМесяцах
	Как Кадровик
	Хочу Получать результат вычисления возраста человека в месяцах
	Чтобы использовать информацию в отчетности

Сценарий:
	Допустим У меня есть дата рождения человека равная 26.12.1983
	И у меня есть текущая дата равная 26.04.2017
	Тогда Возраст Человека будет равен 400

Сценарий:
	Допустим У меня есть дата рождения человека равная 26.12.1983
	И у меня есть текущая дата равная 27.04.2017
	Тогда Результат будет равен 400
